[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:62:16
                 </NavDropdown>
               )}
 
-              {currentUser && currentUser.loggedIn ? (
+              {false ? (
                 <>
                   <Nav.Link as={Link} to="/restaurants">
killedBy: AppNavbar tests renders the ucsbdates link correctly
statusReason: Error: Unable to find an element with the text: UCSB Dates. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
