[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:24:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {!initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="orgCode">OrgCode</Form.Label>
-          <Form.Control
-            id="orgCode"
-            type="text"
-            isInvalid={Boolean(errors.orgCode)}
-            {...register("orgCode", {
-              required: "OrgCode is required.",
-            })}
-          />
-          <Form.Control.Feedback type="invalid">
-            {errors.orgCode?.message}
-          </Form.Control.Feedback>
-        </Form.Group>
-      )}
+      {true}
 
       {initialContents && (
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: TestingLibraryElementError: Unable to find an element with the text: OrgCode. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:24:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {!initialContents && (
+      {initialContents && (
         <Form.Group className="mb-3">
           <Form.Label htmlFor="orgCode">OrgCode</Form.Label>
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: TestingLibraryElementError: Unable to find an element with the text: OrgCode. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:41:8
         </Form.Group>
       )}
 
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="orgCode">OrgCode</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-orgCode"}
-            id="orgCode"
-            type="text"
-            {...register("orgCode")}
-            value={initialContents.orgCode}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: UCSBOrganizationForm tests renders correctly when passing in initialContents
statusReason: TestingLibraryElementError: Unable to find an element with the text: OrgCode. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:41:8
         </Form.Group>
       )}
 
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="orgCode">OrgCode</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-orgCode"}
-            id="orgCode"
-            type="text"
-            {...register("orgCode")}
-            value={initialContents.orgCode}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: UCSBOrganizationForm tests renders correctly when passing in initialContents
statusReason: TestingLibraryElementError: Unable to find an element with the text: OrgCode. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:48:26
             data-testid={testIdPrefix + "-orgCode"}
             id="orgCode"
             type="text"
-            {...register("orgCode")}
+            {...register("")}
             value={initialContents.orgCode}
             disabled
killedBy: UCSBOrganizationForm tests renders correctly when passing in initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationForm.js:93:23
           id="inactive"
           isInvalid={Boolean(errors.inactive)}
           {...register("inactive", {
-            validate: (value) => value !== "invalid" || "Inactive is required.",
+            validate: () => undefined,
           })}
         >
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Inactive is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:93:34
           id="inactive"
           isInvalid={Boolean(errors.inactive)}
           {...register("inactive", {
-            validate: (value) => value !== "invalid" || "Inactive is required.",
+            validate: (value) => true,
           })}
         >
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Inactive is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
