[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:51:5
       Header: "OrgTranslation",
       accessor: "orgTranslation",
     },
-    {
-      Header: "Inactive",
-      accessor: (inactive_key) => inactive_key.inactive.toString(),
-    },
+    {},
   ];
 
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.js:53:17
     },
     {
       Header: "Inactive",
-      accessor: (inactive_key) => inactive_key.inactive.toString(),
+      accessor: () => undefined,
     },
   ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
