[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewTable.js:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/menuitemreviews/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: MenuItemReviewTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/menuitemreviews/edit/23"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style
