[Killed] ArrowFunction
main/pages/MenuItemReviews/MenuItemReviewsEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (menuitemreview) => ({
-    url: "/api/menuitemreview",
-    method: "PUT",
-    params: {
-      id: menuitemreview.id,
-    },
-    data: {
-      itemId: menuitemreview.itemId,
-      reviewerEmail: menuitemreview.reviewerEmail,
-      stars: menuitemreview.stars,
-      comments: menuitemreview.comments,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (menuitemreview) => {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided and changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "MenuItemReview Updated - id: 17 itemId: 105"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsEditPage.js:42:41
     },
   });
 
-  const onSuccess = (menuitemreview) => {
-    toast(
-      `MenuItemReview Updated - id: ${menuitemreview.id} itemId: ${menuitemreview.itemId}`,
-    );
-  };
+  const onSuccess = (menuitemreview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided and changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/MenuItemReviews/MenuItemReviewsEditPage.js:44:7
 
   const onSuccess = (menuitemreview) => {
     toast(
-      `MenuItemReview Updated - id: ${menuitemreview.id} itemId: ${menuitemreview.itemId}`,
+      ``,
     );
   };
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided and changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "MenuItemReview Updated - id: 17 itemId: 105"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/MenuItemReviews/MenuItemReviewsEditPage.js:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit MenuItemReview</h1>
-        {menuitemreview && (
-          <MenuItemReviewForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={menuitemreview}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided and changed
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/MenuItemReviews/MenuItemReviewsEditPage.js:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit MenuItemReview</h1>
-        {menuitemreview && (
-          <MenuItemReviewForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={menuitemreview}
-          />
-        )}
+        {menuitemreview || <MenuItemReviewForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={menuitemreview} />}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided and changed
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, itemId, reviewerEmail, stars, comments}). If you meant to render a collection of children, use an array instead.
