[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsIndexPage.js:25:45
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/menuitemreviews/create"
-          style={{ float: "right" }}
-        >
-          Create MenuItemReview
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: MenuItemReviewIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create MenuItemReview/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
