[Killed] EqualityOperator
main/components/Articles/ArticlesForm.js:8:30
 // Helper function to format date for the datetime-local input
 export const formatDateForInput = (dateString) => {
   // This explicit check is needed to handle null, undefined, and empty string
-  if (dateString === null || dateString === undefined || dateString === '') {
+  if (dateString === null || dateString !== undefined || dateString === '') {
     return '';
   }
killedBy: ArticlesForm tests formatDateForInput tests already formatted input with T and colon
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2022-02-02T12:00"
Received: ""

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:8:7
 // Helper function to format date for the datetime-local input
 export const formatDateForInput = (dateString) => {
   // This explicit check is needed to handle null, undefined, and empty string
-  if (dateString === null || dateString === undefined || dateString === '') {
+  if ((dateString === null || dateString === undefined) && dateString === '') {
     return '';
   }
killedBy: ArticlesForm tests formatDateForInput tests null input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "1969-12-31T16:00"

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:13:7
   }
   
   // If it's already in the right format, return it
-  if (typeof dateString === 'string' && dateString.includes('T')) {
+  if (false) {
     // Ensure it has seconds if needed
     if (!dateString.includes(':')) {
killedBy: ArticlesForm tests formatDateForInput tests already formatted input with T but without colon
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2022-02-02T1200:00"
Received: ""

[Killed] EqualityOperator
main/components/Articles/ArticlesForm.js:13:7
   }
   
   // If it's already in the right format, return it
-  if (typeof dateString === 'string' && dateString.includes('T')) {
+  if (typeof dateString !== 'string' && dateString.includes('T')) {
     // Ensure it has seconds if needed
     if (!dateString.includes(':')) {
killedBy: ArticlesForm tests formatDateForInput tests already formatted input with T but without colon
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2022-02-02T1200:00"
Received: ""

[Killed] BlockStatement
main/components/Articles/ArticlesForm.js:15:36
   // If it's already in the right format, return it
   if (typeof dateString === 'string' && dateString.includes('T')) {
     // Ensure it has seconds if needed
-    if (!dateString.includes(':')) {
-      return dateString + ':00';
-    }
+    if (!dateString.includes(':')) {}
     return dateString;
   }
killedBy: ArticlesForm tests formatDateForInput tests already formatted input with T but without colon
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2022-02-02T1200:00"
Received: "2022-02-02T1200"

[Killed] BooleanLiteral
main/components/Articles/ArticlesForm.js:15:9
   // If it's already in the right format, return it
   if (typeof dateString === 'string' && dateString.includes('T')) {
     // Ensure it has seconds if needed
-    if (!dateString.includes(':')) {
+    if (dateString.includes(':')) {
       return dateString + ':00';
     }
killedBy: ArticlesForm tests formatDateForInput tests already formatted input with T and colon
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2022-02-02T12:00"
Received: "2022-02-02T12:00:00"

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:16:27
   if (typeof dateString === 'string' && dateString.includes('T')) {
     // Ensure it has seconds if needed
     if (!dateString.includes(':')) {
-      return dateString + ':00';
+      return dateString + "";
     }
     return dateString;
killedBy: ArticlesForm tests formatDateForInput tests already formatted input with T but without colon
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2022-02-02T1200:00"
Received: "2022-02-02T1200"

[Killed] BlockStatement
main/components/Articles/ArticlesForm.js:22:7
   }
   
   // Try to parse the date and format it
-  try {
-    const date = new Date(dateString);
-    // Explicit check for invalid date
-    if (isNaN(date.getTime())) {
-      return '';
-    }
-    
-    // Format as YYYY-MM-DDThh:mm in local timezone instead of UTC
-    const year = date.getFullYear();
-    const month = String(date.getMonth() + 1).padStart(2, '0');
-    const day = String(date.getDate()).padStart(2, '0');
-    const hours = String(date.getHours()).padStart(2, '0');
-    const minutes = String(date.getMinutes()).padStart(2, '0');
-    
-    return `${year}-${month}-${day}T${hours}:${minutes}`;
-  } catch (e) {
+  try {} catch (e) {
     return '';
   }
killedBy: ArticlesForm tests formatDateForInput tests valid date string
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] BlockStatement
main/components/Articles/ArticlesForm.js:25:32
   try {
     const date = new Date(dateString);
     // Explicit check for invalid date
-    if (isNaN(date.getTime())) {
-      return '';
-    }
+    if (isNaN(date.getTime())) {}
     
     // Format as YYYY-MM-DDThh:mm in local timezone instead of UTC
killedBy: ArticlesForm tests formatDateForInput tests invalid date string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "NaN-NaN-NaNTNaN:NaN"

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:25:9
   try {
     const date = new Date(dateString);
     // Explicit check for invalid date
-    if (isNaN(date.getTime())) {
+    if (false) {
       return '';
     }
killedBy: ArticlesForm tests formatDateForInput tests invalid date string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "NaN-NaN-NaNTNaN:NaN"

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:26:14
     const date = new Date(dateString);
     // Explicit check for invalid date
     if (isNaN(date.getTime())) {
-      return '';
+      return "Stryker was here!";
     }
     
killedBy: ArticlesForm tests formatDateForInput tests invalid date string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:31:59
     
     // Format as YYYY-MM-DDThh:mm in local timezone instead of UTC
     const year = date.getFullYear();
-    const month = String(date.getMonth() + 1).padStart(2, '0');
+    const month = String(date.getMonth() + 1).padStart(2, "");
     const day = String(date.getDate()).padStart(2, '0');
     const hours = String(date.getHours()).padStart(2, '0');
killedBy: ArticlesForm tests formatDateForInput tests valid date string
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^\d{4}-\d{2}-\d{2}T\d{2}:\d{2}$/
Received string:  "2022-2-01T16:00"

[Survived] StringLiteral
main/components/Articles/ArticlesForm.js:33:55
     const year = date.getFullYear();
     const month = String(date.getMonth() + 1).padStart(2, '0');
     const day = String(date.getDate()).padStart(2, '0');
-    const hours = String(date.getHours()).padStart(2, '0');
+    const hours = String(date.getHours()).padStart(2, "");
     const minutes = String(date.getMinutes()).padStart(2, '0');
     

[Killed] BlockStatement
main/components/Articles/ArticlesForm.js:37:15
     const minutes = String(date.getMinutes()).padStart(2, '0');
     
     return `${year}-${month}-${day}T${hours}:${minutes}`;
-  } catch (e) {
-    return '';
-  }
+  } catch (e) {}
 };
 
killedBy: ArticlesForm tests formatDateForInput tests handles exception case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: undefined

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:65:7
   //   /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\d)/i;
 
   // Initialize dateAdded with proper format if it exists
-  if (initialContents && initialContents.dateAdded !== undefined && initialContents.dateAdded !== null) {
+  if (initialContents || initialContents.dateAdded !== undefined && initialContents.dateAdded !== null) {
     initialContents.dateAdded = formatDateForInput(initialContents.dateAdded);
   }
killedBy: ArticlesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'dateAdded')

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:65:7
   //   /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\d)/i;
 
   // Initialize dateAdded with proper format if it exists
-  if (initialContents && initialContents.dateAdded !== undefined && initialContents.dateAdded !== null) {
+  if (true) {
     initialContents.dateAdded = formatDateForInput(initialContents.dateAdded);
   }
killedBy: ArticlesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'dateAdded')

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:112:31
           id="url"
           type="url"
           isInvalid={Boolean(errors.url)}
-          {...register("url", {
-            required: "URL is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-            pattern: {
-              value: /^https?:\/\/.+/i,
-              message: "URL must start with http:// or https://",
-            },
-          })}
+          {...register("url", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /URL is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Survived] Regex
main/components/Articles/ArticlesForm.js:119:22
               message: "Max length 255 characters",
             },
             pattern: {
-              value: /^https?:\/\/.+/i,
+              value: /https?:\/\/.+/i,
               message: "URL must start with http:// or https://",
             },

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:120:24
             },
             pattern: {
               value: /^https?:\/\/.+/i,
-              message: "URL must start with http:// or https://",
+              message: "",
             },
           })}
killedBy: ArticlesForm tests URL validation works correctly
statusReason: Error: Unable to find an element with the text: /URL must start with http:\/\/ or https:\/\//. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:158:22
           isInvalid={Boolean(errors.email)}
           {...register("email", {
             required: "Email is required.",
-            pattern: {
-              value: /^[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,}$/i,
-              message: "Invalid email address",
-            },
+            pattern: {},
           })}
         />
killedBy: ArticlesForm tests Email validation works correctly
statusReason: Error: Unable to find an element with the text: /Invalid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] Regex
main/components/Articles/ArticlesForm.js:159:22
           {...register("email", {
             required: "Email is required.",
             pattern: {
-              value: /^[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,}$/i,
+              value: /^[A-Z0-9._%+-]@[A-Z0-9.-]+\.[A-Z]{2,}$/i,
               message: "Invalid email address",
             },
killedBy: ArticlesForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:176:37
           id="dateAdded"
           type="datetime-local"
           isInvalid={Boolean(errors.dateAdded)}
-          {...register("dateAdded", {
-            required: "Date Added is required.",
-            validate: {
-              isValidDate: (value) => {
-                const date = new Date(value);
-                return !isNaN(date.getTime()) || "Please enter a valid date";
-              }
-            }
-          })}
+          {...register("dateAdded", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Added is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Survived] BlockStatement
main/components/Articles/ArticlesForm.js:179:39
           {...register("dateAdded", {
             required: "Date Added is required.",
             validate: {
-              isValidDate: (value) => {
-                const date = new Date(value);
-                return !isNaN(date.getTime()) || "Please enter a valid date";
-              }
+              isValidDate: (value) => {}
             }
           })}

[Killed] BooleanLiteral
main/components/Articles/ArticlesForm.js:181:24
             validate: {
               isValidDate: (value) => {
                 const date = new Date(value);
-                return !isNaN(date.getTime()) || "Please enter a valid date";
+                return isNaN(date.getTime()) || "Please enter a valid date";
               }
             }
killedBy: ArticlesForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:181:24
             validate: {
               isValidDate: (value) => {
                 const date = new Date(value);
-                return !isNaN(date.getTime()) || "Please enter a valid date";
+                return false;
               }
             }
killedBy: ArticlesForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />
