[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:50:42
           id="requesterEmail"
           type="text"
           isInvalid={Boolean(errors.requesterEmail)}
-          {...register("requesterEmail", {
-            required: "Requester email is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("requesterEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Requester email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:52:24
           isInvalid={Boolean(errors.requesterEmail)}
           {...register("requesterEmail", {
             required: "Requester email is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:108:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateRequested && "Date requested is required."}
+          {errors.dateRequested || "Date requested is required."}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:119:38
           type="datetime-local"
           isInvalid={Boolean(errors.dateNeeded)}
           step="1"
-          {...register("dateNeeded", {
-            required: true,
-            pattern: isodate_regex,
-          })}
+          {...register("dateNeeded", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date needed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:133:60
         <Form.Label htmlFor="done">
           Done? (if checked the recommendation is done; else it is not done.)
         </Form.Label>
-        <Form.Check type="checkbox" id="done" {...register("done")} />
+        <Form.Check type="checkbox" id="done" {...register("")} />
       </Form.Group>
 
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
