[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:65:17
     {
       Header: "Done?",
       id: "done",
-      accessor: (my_recReq) => String(my_recReq.done),
+      accessor: () => undefined,
     },
   ];
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
