[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestEditPage.js:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/recommendationrequest?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/recommendationrequest`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
