[Killed] BlockStatement
main/components/Articles/ArticlesTable.js:15:34
 export default function ArticlesTable({ articles, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    return navigate(`/articles/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: ArticlesTable tests Edit button navigates to the correct edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/articles/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>
