[Killed] BlockStatement
src/main/utils/articleUtils.js:3:42
 import { toast } from "react-toastify";
 
-export function onDeleteSuccess(message) {
-  console.log(`Article deletion: ${message}`);
-  toast(message);
-}
+export function onDeleteSuccess(message) {}
 
 export function cellToAxiosParamsDelete(cell) {
killedBy: ArticleUtils functions onDeleteSuccess function Logs message to console and displays toast notification
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Article successfully deleted"

Number of calls: 0

[Killed] BlockStatement
src/main/utils/articleUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  const { id } = cell.row.values;
-
-  return {
-    url: "/api/articles",
-    method: "DELETE",
-    params: { id },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: ArticleUtils functions cellToAxiosParamsDelete Returns correct axios parameters object
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": 42}, "url": "/api/articles"}
Received: undefined
