[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:74:46
               id="requesterEmail"
               type="text"
               isInvalid={Boolean(errors.requesterEmail)}
-              {...register("requesterEmail", {
-                required: "Email is required.",
-              })}
+              {...register("requesterEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/HelpRequest/HelpRequestForm.js:97:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.teamID?.message}
+              {errors.teamID.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:112:51
               id="tableOrBreakoutRoom"
               type="text"
               isInvalid={Boolean(errors.tableOrBreakoutRoom)}
-              {...register("tableOrBreakoutRoom", {
-                required: "Table or breakout room number is required.",
-              })}
+              {...register("tableOrBreakoutRoom", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table or breakout room number is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:113:27
               type="text"
               isInvalid={Boolean(errors.tableOrBreakoutRoom)}
               {...register("tableOrBreakoutRoom", {
-                required: "Table or breakout room number is required.",
+                required: "",
               })}
             />
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table or breakout room number is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:164:28
               type="checkbox"
               id="solved"
               data-testid="HelpRequestForm-solved"
-              {...register("solved")}
+              {...register("")}
             />
           </Form.Group>
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
