[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:38:5
       Header: "id",
       accessor: "id", // accessor is the "key" in the data
     },
-    {
-      Header: "Email",
-      accessor: "requesterEmail",
-    },
+    {},
     {
       Header: "Team ID",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/HelpRequest/HelpRequestTable.js:57:17
     {
       Header: "Solved",
       id: "solved",
-      accessor: (key) => String(key.solved),
+      accessor: () => undefined,
     },
     {
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
