[Killed] ObjectLiteral
src/main/utils/ucsbOrganizationUtils.js:9:10
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/ucsborganizations",
-    method: "DELETE",
-    params: {
-      orgCode: cell.row.values.orgCode,
-    },
-  };
+  return {};
 }
 
killedBy: UCSBOrganizationIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Organization with orgCode ZPR was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
