[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.js:3:53
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function MenuItemReviewsCreatePage() {
-  // Stryker disable all : MenuItemReview for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function MenuItemReviewsCreatePage() {}
 
killedBy: MenuItemReviewsCreatePage tests Renders expected content
statusReason: Error: Unable to find an element with the text: Create page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
