[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:92:24
           isInvalid={Boolean(errors.comments)}
           {...register("comments", {
             required: "Comments is required.",
-            maxLength: {
-              value: 255,
-              message: "Comments must be less than 255 characters.",
-            },
+            maxLength: {},
           })}
         />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Comments must be less than 255 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:94:24
             required: "Comments is required.",
             maxLength: {
               value: 255,
-              message: "Comments must be less than 255 characters.",
+              message: "",
             },
           })}
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Comments must be less than 255 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
